artifacts/oscar_e2e/fig4_right_qwen3_8b_cached/vq2_s8/in100000_bs32/bench_serving.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31005, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:31005/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31005, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', model='Qwen/Qwen3-8B', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=32, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=32, gsp_system_prompt_len=100000, gsp_question_len=128, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_1_1_32_100000_128_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 32        
Successful requests:                     32        
Benchmark duration (s):                  163.71    
Total input tokens:                      3371395   
Total input text tokens:                 3371395   
Total generated tokens:                  32000     
Total generated tokens (retokenized):    30064     
Request throughput (req/s):              0.20      
Input token throughput (tok/s):          20593.17  
Output token throughput (tok/s):         195.46    
Peak output token throughput (tok/s):    541.00    
Peak concurrent requests:                32        
Total token throughput (tok/s):          20788.63  
Concurrency:                             31.73     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   162313.06 
Median E2E Latency (ms):                 162856.83 
P90 E2E Latency (ms):                    163563.33 
P99 E2E Latency (ms):                    163601.26 
---------------Time to First Token----------------
Mean TTFT (ms):                          10436.17  
Median TTFT (ms):                        10423.70  
P99 TTFT (ms):                           10737.83  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          152.03    
Median TPOT (ms):                        152.59    
P99 TPOT (ms):                           153.32    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           152.03    
Median ITL (ms):                         154.90    
P95 ITL (ms):                            155.62    
P99 ITL (ms):                            156.12    
Max ITL (ms):                            331.11    
==================================================
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [02:40<1:22:42, 160.07s/it]
 22%|██▏       | 7/32 [02:40<07:00, 16.82s/it]   
 25%|██▌       | 8/32 [02:41<05:35, 13.96s/it]
 28%|██▊       | 9/32 [02:41<04:18, 11.23s/it]
 31%|███▏      | 10/32 [02:41<03:12,  8.76s/it]
 34%|███▍      | 11/32 [02:42<02:20,  6.70s/it]
 38%|███▊      | 12/32 [02:42<01:40,  5.01s/it]
 41%|████      | 13/32 [02:42<01:10,  3.73s/it]
 44%|████▍     | 14/32 [02:42<00:49,  2.75s/it]
 47%|████▋     | 15/32 [02:42<00:34,  2.03s/it]
 50%|█████     | 16/32 [02:42<00:23,  1.47s/it]
 56%|█████▋    | 18/32 [02:43<00:11,  1.18it/s]
 59%|█████▉    | 19/32 [02:43<00:08,  1.47it/s]
 66%|██████▌   | 21/32 [02:43<00:04,  2.32it/s]
 75%|███████▌  | 24/32 [02:43<00:02,  3.99it/s]
 88%|████████▊ | 28/32 [02:43<00:00,  6.61it/s]
100%|██████████| 32/32 [02:43<00:00,  5.12s/it]